#Домашнє завдання: Модуль - 3, завдання - 2. Python Core 2.0. (PYTHON SOFTWARE ENGINEERING. Гнучкий формат)

# Імпорт модуля random
import random
'''
ОПИС:
    Функція, яка генерує набір унікальних випадкових чисел у межах заданих параметрів (min, max, quantity).
ВХІДНІ ПАРАМЕТРИ:
    min — число (int), мінімальне можливе число у наборі (не менше 1).
    max - число (int), максимальне можливе число у наборі (не більше 1000).
    quantity - число (int), кількість чисел, які потрібно вибрати (значення між min та max).
ВИХІДНІ ДАНІ:
    tickets_lst - список (list), випадково вибраних, унікальних, відсортованих чисел в межах діапазону (min, max).
ОБМЕЖЕННЯ:
    Якщо вхідні параметри не відповідають заданим обмеженням, функція повертає пустий список.
'''
def get_numbers_ticket(min, max, quantity):
    # Ініціалізація списку
    tickets_lst = []
    # Перевірка обмежень та повернення пустого списку, якщо перевірка не пройдена
    if min < 1 or max > 1000 or quantity > (max - min + 1):
        return tickets_lst
    else:
        # Створення списку із максимальним наповненням можливих варіантів
        for i in range(min, max + 1):
            tickets_lst.append(i)
        # Створення списку із заданої кількості випадкових унікальних чисел
        tickets_lst = random.sample(tickets_lst, k = quantity)
        # Сортування чисел в списку від меншого до більшого
        tickets_lst.sort()            
        # Вивід результату
        return tickets_lst