#Домашнє завдання: Модуль - 3, завдання - 1. Python Core 2.0. (PYTHON SOFTWARE ENGINEERING. Гнучкий формат)

# Імпорт модуля datetime
import datetime 
'''
ОПИС:
    Функція, яка розраховує кількість днів між заданою датою та поточною датою.
ВХІДНІ ПАРАМЕТРИ:
    date — рядок (str), що представляє дату у форматі 'РРРР-ММ-ДД', (наприклад, '2020-10-09').
ВИХІДНІ ДАНІ:
    date_diffence - ціле число (int), різниця у днях.
ВИНЯТКИ:
    при введенні дати не у форматі 'РРРР-ММ-ДД' виникне помилка ValueError, при цьому функція поверне None та
    виведе в консоль повідомлення щодо цієї проблеми
'''
def get_days_from_today(date):
    # Обробка винятку - неправильний формат
    try:
        # Перетворення рядка дати у форматі 'РРРР-ММ-ДД' у об'єкт datetime
        date_start = datetime.datetime.strptime(date,"%Y-%m-%d")
    except ValueError:
        # Виведення рядока-попередження у випадку виникнення винятку при введенні дати
        print(f"Ви ввели '{date}' - це не правильний формат! Будь-ласка, введіть дату у форматі РРРР-ММ-ДД")
        return None
    else:   
        # Отримання поточної дати
        date_today = datetime.datetime.today()
        # Розрахунок різниці між поточною датою та заданою датою
        date_diffence = (date_start.date() - date_today.date()).days
        # Повернення різниці у днях як цілого числа
        return date_diffence